# Да се напише shell скрипт, който валидира дали дадено цяло число попада в целочислен интервал.
# Скриптът приема 3 аргумента: числото, което трябва да се провери; лява граница на интервала; дясна граница на интервала.
# Скриптът да връща exit status:
# - 3, когато поне един от трите аргумента не е цяло число
# - 2, когато границите на интервала са обърнати
# - 1, когато числото не попада в интервала
# - 0, когато числото попада в интервала

# Примери:
# $ ./validint.sh -42 0 102; echo $?
# 1

# $ ./validint.sh 88 94 280; echo $?
# 1

# $ ./validint.sh 32 42 0; echo $?
# 2

# $ ./validint.sh asdf - 280; echo $?
# 3


#!/bin/bash

if [[ $# -ne 3 ]]; then
    echo "Invalid args count"
    exit 4
fi

if [[ ! "$1" =~ ^[0-9]+$ ]] || [[ ! "$2" =~ ^[0-9]+$ ]] || [[ ! "$3" =~ ^[0-9]+$ ]]; then
    echo "Expected integers"
    exit 3
fi

if [[ $3 -lt $2 ]]; then 
    echo "Invalid interval"
    exit 2
fi

if [[ $1 -gt $3 ]] && [[ $1 -lt $2 ]]; then 
    echo "Not in the interval"
    exit 1
fi

exit 0
